<a href="https://colab.research.google.com/github/slidemorning/Kaggle/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [2]:
'''
1. Series (Data Structure Of Pandas)
'''

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# values
obj.values

array([ 4,  7, -5,  3])

In [4]:
# index
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# type
obj.dtypes

dtype('int64')

In [6]:
# using index param
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
# create Series using dictionary
dic = {'apple':1000, 'orange':1200, 'grape':1100}
obj3 = pd.Series(dic)
# key->index , value->value
obj3

apple     1000
orange    1200
grape     1100
dtype: int64

In [8]:
obj3.name = 'price of fruit'
obj3.index.name = 'kinds of fruit'
obj3

kinds of fruit
apple     1000
orange    1200
grape     1100
Name: price of fruit, dtype: int64

In [9]:
obj3.index = ['strawberry', 'melon', 'mango']
obj3

strawberry    1000
melon         1200
mango         1100
Name: price of fruit, dtype: int64

In [11]:
'''
2. Data Frame (Data Structure Of Pandas)
'''
# method to create df
# 1. using dictionary
# 2. using array of numpy 

dic = {'name':['tony', 'erik', 'son', 'park'],
       'year':[1991, 1995, 1990, 1994],
       'score':[87, 90, 92, 98]}
df = pd.DataFrame(dic)
df

   name  year  score
0  tony  1991     87
1  erik  1995     90
2   son  1990     92
3  park  1994     98

In [12]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.columns

Index(['name', 'year', 'score'], dtype='object')

In [15]:
df.values

array([['tony', 1991, 87],
       ['erik', 1995, 90],
       ['son', 1990, 92],
       ['park', 1994, 98]], dtype=object)

In [16]:
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info  name  year  score
Num
0     tony  1991     87
1     erik  1995     90
2      son  1990     92
3     park  1994     98

In [18]:
df2 = pd.DataFrame(dic, columns=['year', 'name', 'score', 'penalty'],
                   index=['one', 'two', 'three', 'four'])
df2

       year  name  score penalty
one    1991  tony     87     NaN
two    1995  erik     90     NaN
three  1990   son     92     NaN
four   1994  park     98     NaN

In [19]:
df2.describe()

              year      score
count     4.000000   4.000000
mean   1992.500000  91.750000
std       2.380476   4.645787
min    1990.000000  87.000000
25%    1990.750000  89.250000
50%    1992.500000  91.000000
75%    1994.250000  93.500000
max    1995.000000  98.000000

In [20]:
dic = {'name': ['kilho', 'kilho', 'kilho', 'charles', 'charles'],
       'year': [2014, 2015, 2016, 2015, 2016],
       'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(dic, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df

       year     name  points penalty
one    2014    kilho     1.5     NaN
two    2015    kilho     1.7     NaN
three  2016    kilho     3.6     NaN
four   2015  charles     2.4     NaN
five   2016  charles     2.9     NaN

In [21]:
'''
  2-1. columns
'''
df['year'] # same expression : df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [22]:
df.year # same expression : df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [23]:
df[['year', 'points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [24]:
df['penalty'] = 0.5
df

       year     name  points  penalty
one    2014    kilho     1.5      0.5
two    2015    kilho     1.7      0.5
three  2016    kilho     3.6      0.5
four   2015  charles     2.4      0.5
five   2016  charles     2.9      0.5

In [33]:
df.columns

Index(['year', 'name', 'points', 'penalty', (0, 'penalty')], dtype='object')

In [34]:
df.drop((0, 'penalty'), axis=1, inplace=True)
df

       year     name  points  penalty
one    2014    kilho     1.5      0.5
two    2015    kilho     1.7      0.5
three  2016    kilho     3.6      0.5
four   2015  charles     2.4      0.5
five   2016  charles     2.9      0.5

In [35]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5]
df

       year     name  points  penalty
one    2014    kilho     1.5      0.1
two    2015    kilho     1.7      0.2
three  2016    kilho     3.6      0.3
four   2015  charles     2.4      0.4
five   2016  charles     2.9      0.5

In [36]:
df['zeros'] = np.arange(5)
df

       year     name  points  penalty  zeros
one    2014    kilho     1.5      0.1      0
two    2015    kilho     1.7      0.2      1
three  2016    kilho     3.6      0.3      2
four   2015  charles     2.4      0.4      3
five   2016  charles     2.9      0.5      4

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df['debt'] = val
df

       year     name  points  penalty  zeros  debt
one    2014    kilho     1.5      0.1      0   NaN
two    2015    kilho     1.7      0.2      1  -1.2
three  2016    kilho     3.6      0.3      2   NaN
four   2015  charles     2.4      0.4      3  -1.5
five   2016  charles     2.9      0.5      4  -1.7

In [39]:
df['net_points'] = df['points'] - df['penalty']
df

       year     name  points  penalty  zeros  debt  net_points
one    2014    kilho     1.5      0.1      0   NaN         1.4
two    2015    kilho     1.7      0.2      1  -1.2         1.5
three  2016    kilho     3.6      0.3      2   NaN         3.3
four   2015  charles     2.4      0.4      3  -1.5         2.0
five   2016  charles     2.9      0.5      4  -1.7         2.4

In [40]:
df['high_points'] = df['net_points'] > 2.0
df

       year     name  points  penalty  zeros  debt  net_points  high_points
one    2014    kilho     1.5      0.1      0   NaN         1.4        False
two    2015    kilho     1.7      0.2      1  -1.2         1.5        False
three  2016    kilho     3.6      0.3      2   NaN         3.3         True
four   2015  charles     2.4      0.4      3  -1.5         2.0        False
five   2016  charles     2.9      0.5      4  -1.7         2.4         True

In [41]:
del df['high_points'] # same expression : df.drop('high_points', axis=1, inplace=True)
del df['net_points']
del df['zeros']
df

       year     name  points  penalty  debt
one    2014    kilho     1.5      0.1   NaN
two    2015    kilho     1.7      0.2  -1.2
three  2016    kilho     3.6      0.3   NaN
four   2015  charles     2.4      0.4  -1.5
five   2016  charles     2.9      0.5  -1.7

In [42]:
df.columns

Index(['year', 'name', 'points', 'penalty', 'debt'], dtype='object')

In [43]:
df.index.name = 'order'
df.columns.name = 'info'
df

info   year     name  points  penalty  debt
order
one    2014    kilho     1.5      0.1   NaN
two    2015    kilho     1.7      0.2  -1.2
three  2016    kilho     3.6      0.3   NaN
four   2015  charles     2.4      0.4  -1.5
five   2016  charles     2.9      0.5  -1.7

In [44]:
'''
  2-2. row(index)
'''
df[0:3] # exclusive

info   year   name  points  penalty  debt
order
one    2014  kilho     1.5      0.1   NaN
two    2015  kilho     1.7      0.2  -1.2
three  2016  kilho     3.6      0.3   NaN

In [45]:
df['one':'three'] # inclusive

info   year   name  points  penalty  debt
order
one    2014  kilho     1.5      0.1   NaN
two    2015  kilho     1.7      0.2  -1.2
three  2016  kilho     3.6      0.3   NaN

In [46]:
# recommended method : using loc, iloc
# loc : using 'name of columns'
# iloc : using number of index


# loc
df.loc['two'] # return Series

info
year        2015
name       kilho
points       1.7
penalty      0.2
debt        -1.2
Name: two, dtype: object

In [47]:
df.loc['two':'four']

info   year     name  points  penalty  debt
order
two    2015    kilho     1.7      0.2  -1.2
three  2016    kilho     3.6      0.3   NaN
four   2015  charles     2.4      0.4  -1.5

In [48]:
df.loc['two':'four', 'points']

order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [49]:
df.loc[:, 'year'] # same expression : df['year']

order
one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [52]:
df.loc[:, ['year', 'name']]

info   year     name
order
one    2014    kilho
two    2015    kilho
three  2016    kilho
four   2015  charles
five   2016  charles

In [53]:
df.loc['three':'five', 'year':'penalty']

info   year     name  points  penalty
order
three  2016    kilho     3.6      0.3
four   2015  charles     2.4      0.4
five   2016  charles     2.9      0.5

In [55]:
df.loc['six', :] = [2013, 'jun', 4.0, 0.1, 2.1]
df

info     year     name  points  penalty  debt
order
one    2014.0    kilho     1.5      0.1   NaN
two    2015.0    kilho     1.7      0.2  -1.2
three  2016.0    kilho     3.6      0.3   NaN
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7
six    2013.0      jun     4.0      0.1   2.1

In [56]:
# iloc

df.iloc[3]

info
year          2015
name       charles
points         2.4
penalty        0.4
debt          -1.5
Name: four, dtype: object

In [57]:
df.iloc[3:5, 0:2]

info     year     name
order
four   2015.0  charles
five   2016.0  charles

In [58]:
df.iloc[[0, 1, 3], [1, 2]]

info      name  points
order
one      kilho     1.5
two      kilho     1.7
four   charles     2.4

In [59]:
df.iloc[:, 1:4]

info      name  points  penalty
order
one      kilho     1.5      0.1
two      kilho     1.7      0.2
three    kilho     3.6      0.3
four   charles     2.4      0.4
five   charles     2.9      0.5
six        jun     4.0      0.1

In [60]:
df.iloc[1, 1]

'kilho'

In [61]:
'''
  3. boolean indexing of Data Frame
'''
df

info     year     name  points  penalty  debt
order
one    2014.0    kilho     1.5      0.1   NaN
two    2015.0    kilho     1.7      0.2  -1.2
three  2016.0    kilho     3.6      0.3   NaN
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7
six    2013.0      jun     4.0      0.1   2.1

In [62]:
df['year'] > 2014

order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [63]:
df.loc[df['year'] > 2014, :]

info     year     name  points  penalty  debt
order
two    2015.0    kilho     1.7      0.2  -1.2
three  2016.0    kilho     3.6      0.3   NaN
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7

In [65]:
df.loc[df['name'] == 'kilho', ['name', 'points']]

info    name  points
order
one    kilho     1.5
two    kilho     1.7
three  kilho     3.6

In [66]:
df.loc[(df['points'] > 2)&(df['points'] < 3), :]

info     year     name  points  penalty  debt
order
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7

In [67]:
df

info     year     name  points  penalty  debt
order
one    2014.0    kilho     1.5      0.1   NaN
two    2015.0    kilho     1.7      0.2  -1.2
three  2016.0    kilho     3.6      0.3   NaN
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7
six    2013.0      jun     4.0      0.1   2.1

In [69]:
df.loc[df['points'] > 3, 'penalty'] = 0
df

info     year     name  points  penalty  debt
order
one    2014.0    kilho     1.5      0.1   NaN
two    2015.0    kilho     1.7      0.2  -1.2
three  2016.0    kilho     3.6      0.0   NaN
four   2015.0  charles     2.4      0.4  -1.5
five   2016.0  charles     2.9      0.5  -1.7
six    2013.0      jun     4.0      0.0   2.1

In [70]:
# Data

df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0  0.412806  0.785678 -2.584773 -0.603822
1  1.460746 -0.305871 -0.813106  0.677055
2  1.149074  1.707585 -0.398772 -0.470960
3  0.190664 -1.402913 -0.772934  0.372401
4  0.053703 -0.141468  1.185618 -0.071422
5 -0.090998 -1.307879  1.304461 -0.626320

In [71]:
df.columns = ['a', 'b', 'c', 'd']
df

          a         b         c         d
0  0.412806  0.785678 -2.584773 -0.603822
1  1.460746 -0.305871 -0.813106  0.677055
2  1.149074  1.707585 -0.398772 -0.470960
3  0.190664 -1.402913 -0.772934  0.372401
4  0.053703 -0.141468  1.185618 -0.071422
5 -0.090998 -1.307879  1.304461 -0.626320

In [79]:
df.index = pd.date_range('20190903', periods=len(df))
df.index

DatetimeIndex(['2019-09-03', '2019-09-04', '2019-09-05', '2019-09-06',
               '2019-09-07', '2019-09-08'],
              dtype='datetime64[ns]', freq='D')

In [80]:
df

                   a         b         c         d
2019-09-03  0.412806  0.785678 -2.584773 -0.603822
2019-09-04  1.460746 -0.305871 -0.813106  0.677055
2019-09-05  1.149074  1.707585 -0.398772 -0.470960
2019-09-06  0.190664 -1.402913 -0.772934  0.372401
2019-09-07  0.053703 -0.141468  1.185618 -0.071422
2019-09-08 -0.090998 -1.307879  1.304461 -0.626320

In [81]:
df['f'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

                   a         b         c         d    f
2019-09-03  0.412806  0.785678 -2.584773 -0.603822  1.0
2019-09-04  1.460746 -0.305871 -0.813106  0.677055  NaN
2019-09-05  1.149074  1.707585 -0.398772 -0.470960  3.5
2019-09-06  0.190664 -1.402913 -0.772934  0.372401  6.1
2019-09-07  0.053703 -0.141468  1.185618 -0.071422  NaN
2019-09-08 -0.090998 -1.307879  1.304461 -0.626320  7.0

In [83]:
df.dropna(how='any')

                   a         b         c         d    f
2019-09-03  0.412806  0.785678 -2.584773 -0.603822  1.0
2019-09-05  1.149074  1.707585 -0.398772 -0.470960  3.5
2019-09-06  0.190664 -1.402913 -0.772934  0.372401  6.1
2019-09-08 -0.090998 -1.307879  1.304461 -0.626320  7.0

In [84]:
df.dropna(how='all')

                   a         b         c         d    f
2019-09-03  0.412806  0.785678 -2.584773 -0.603822  1.0
2019-09-04  1.460746 -0.305871 -0.813106  0.677055  NaN
2019-09-05  1.149074  1.707585 -0.398772 -0.470960  3.5
2019-09-06  0.190664 -1.402913 -0.772934  0.372401  6.1
2019-09-07  0.053703 -0.141468  1.185618 -0.071422  NaN
2019-09-08 -0.090998 -1.307879  1.304461 -0.626320  7.0

In [85]:
df['g'] = np.nan
df

                   a         b         c         d    f   g
2019-09-03  0.412806  0.785678 -2.584773 -0.603822  1.0 NaN
2019-09-04  1.460746 -0.305871 -0.813106  0.677055  NaN NaN
2019-09-05  1.149074  1.707585 -0.398772 -0.470960  3.5 NaN
2019-09-06  0.190664 -1.402913 -0.772934  0.372401  6.1 NaN
2019-09-07  0.053703 -0.141468  1.185618 -0.071422  NaN NaN
2019-09-08 -0.090998 -1.307879  1.304461 -0.626320  7.0 NaN

In [87]:
df.loc['2019-09-09'] = np.nan
df

                            a         b         c         d    f   g
2019-09-03 00:00:00  0.412806  0.785678 -2.584773 -0.603822  1.0 NaN
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055  NaN NaN
2019-09-05 00:00:00  1.149074  1.707585 -0.398772 -0.470960  3.5 NaN
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401  6.1 NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422  NaN NaN
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320  7.0 NaN
2019-09-09                NaN       NaN       NaN       NaN  NaN NaN

In [0]:
df.dropna(how='all', inplace=True)

In [92]:
df

                            a         b         c         d    f   g
2019-09-03 00:00:00  0.412806  0.785678 -2.584773 -0.603822  1.0 NaN
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055  NaN NaN
2019-09-05 00:00:00  1.149074  1.707585 -0.398772 -0.470960  3.5 NaN
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401  6.1 NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422  NaN NaN
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320  7.0 NaN

In [93]:
df.fillna(value=111)

                            a         b         c         d      f      g
2019-09-03 00:00:00  0.412806  0.785678 -2.584773 -0.603822    1.0  111.0
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055  111.0  111.0
2019-09-05 00:00:00  1.149074  1.707585 -0.398772 -0.470960    3.5  111.0
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401    6.1  111.0
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422  111.0  111.0
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320    7.0  111.0

In [96]:
df.isnull()

                         a      b      c      d      f     g
2019-09-03 00:00:00  False  False  False  False  False  True
2019-09-04 00:00:00  False  False  False  False   True  True
2019-09-05 00:00:00  False  False  False  False  False  True
2019-09-06 00:00:00  False  False  False  False  False  True
2019-09-07 00:00:00  False  False  False  False   True  True
2019-09-08 00:00:00  False  False  False  False  False  True

In [97]:
df.loc[df.isnull()['f'], :]

                            a         b         c         d   f   g
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055 NaN NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422 NaN NaN

In [99]:
df.isnull()['f']

2019-09-03    False
2019-09-04     True
2019-09-05    False
2019-09-06    False
2019-09-07     True
2019-09-08    False
Name: f, dtype: bool

In [100]:
df.loc[df.isnull()['f'] == 1, :]

                            a         b         c         d   f   g
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055 NaN NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422 NaN NaN

In [101]:
pd.to_datetime('20190903')

Timestamp('2019-09-03 00:00:00')

In [102]:
df.drop(pd.to_datetime('20190903'))

                            a         b         c         d    f   g
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055  NaN NaN
2019-09-05 00:00:00  1.149074  1.707585 -0.398772 -0.470960  3.5 NaN
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401  6.1 NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422  NaN NaN
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320  7.0 NaN

In [103]:
df.drop([pd.to_datetime('20190904'), pd.to_datetime('20190905')])

                            a         b         c         d    f   g
2019-09-03 00:00:00  0.412806  0.785678 -2.584773 -0.603822  1.0 NaN
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401  6.1 NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422  NaN NaN
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320  7.0 NaN

In [104]:
df.drop('f', axis=1)

                            a         b         c         d   g
2019-09-03 00:00:00  0.412806  0.785678 -2.584773 -0.603822 NaN
2019-09-04 00:00:00  1.460746 -0.305871 -0.813106  0.677055 NaN
2019-09-05 00:00:00  1.149074  1.707585 -0.398772 -0.470960 NaN
2019-09-06 00:00:00  0.190664 -1.402913 -0.772934  0.372401 NaN
2019-09-07 00:00:00  0.053703 -0.141468  1.185618 -0.071422 NaN
2019-09-08 00:00:00 -0.090998 -1.307879  1.304461 -0.626320 NaN

In [105]:
df.drop(['a', 'b'], axis=1)

                            c         d    f   g
2019-09-03 00:00:00 -2.584773 -0.603822  1.0 NaN
2019-09-04 00:00:00 -0.813106  0.677055  NaN NaN
2019-09-05 00:00:00 -0.398772 -0.470960  3.5 NaN
2019-09-06 00:00:00 -0.772934  0.372401  6.1 NaN
2019-09-07 00:00:00  1.185618 -0.071422  NaN NaN
2019-09-08 00:00:00  1.304461 -0.626320  7.0 NaN

In [106]:
# Methods for Data Analysis

data = [[1.4, np.nan],
        [7.1, -4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
df = pd.DataFrame(data, columns=['f1', 'f2'],
                  index=['a', 'b', 'c', 'd'])
df

     f1   f2
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [107]:
# sum
df.sum(axis=0) # direction of row (down)

f1    9.25
f2   -5.80
dtype: float64

In [108]:
df.sum(axis=1) # direction of columns (right)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [109]:
df.sum() # default direction(axis) is 0

f1    9.25
f2   -5.80
dtype: float64

In [110]:
# defalut : nan is ignored
# set param skipna=False
# nan + anything = nan
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [111]:
df['f1'].sum()

9.25

In [112]:
df.loc['b'].sum()

2.5999999999999996

In [113]:
'''
sum() 
count() # number of not nan value
min(), max() # minimum, maximum value
argmin(), argmax() # index of minimum, maximum value
idxmin(), idxmax() # minimum, maximum value of idx
mean() # mean
median() # median
mad() # absolute deviation
std(), var() # standard, variance
cumsum() # from 0 ~
cumprod() # from 1 ~
'''

'\nsum()\ncount()\nmin(), max()\nargmin(), argmax()\nidxmin(), idxmax()\nmean()\nmedian()\nmad()\nstd(), var()\ncumsum()\ncumprod()\n'

In [114]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=['f1', 'f2', 'f3', 'f4'],
                   index=pd.date_range('20190819', periods=6))
df2

                  f1        f2        f3        f4
2019-08-19  0.290107 -1.003232  2.150938 -0.219107
2019-08-20 -1.197955 -2.391547 -0.289861 -0.957297
2019-08-21 -1.591266  0.458595  0.405646  0.492458
2019-08-22 -0.591570 -0.426321  1.890617  1.947095
2019-08-23  0.436061 -0.298017 -1.461563  0.486023
2019-08-24  1.065241 -1.928416  0.497166  1.698973

In [117]:
# correlation of f2, f3
df2['f2'].corr(df2['f3'])

0.05068825008146462

In [118]:
# covariance of f2, f3
df2['f2'].cov(df2['f3'])

0.07327299867654559

In [120]:
# etc method (sort ...)

dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index=random_dates, columns=['f4', 'f2', 'f3', 'f1'])
df2

                  f4        f2        f3        f1
2019-08-21  0.492458  0.458595  0.405646 -1.591266
2019-08-22  1.947095 -0.426321  1.890617 -0.591570
2019-08-24  1.698973 -1.928416  0.497166  1.065241
2019-08-23  0.486023 -0.298017 -1.461563  0.436061
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955
2019-08-19 -0.219107 -1.003232  2.150938  0.290107

In [122]:
# sort_index()
# sort_values()
df2.sort_index(axis=0)

                  f4        f2        f3        f1
2019-08-19 -0.219107 -1.003232  2.150938  0.290107
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955
2019-08-21  0.492458  0.458595  0.405646 -1.591266
2019-08-22  1.947095 -0.426321  1.890617 -0.591570
2019-08-23  0.486023 -0.298017 -1.461563  0.436061
2019-08-24  1.698973 -1.928416  0.497166  1.065241

In [123]:
df2.sort_index(axis=1)

                  f1        f2        f3        f4
2019-08-21 -1.591266  0.458595  0.405646  0.492458
2019-08-22 -0.591570 -0.426321  1.890617  1.947095
2019-08-24  1.065241 -1.928416  0.497166  1.698973
2019-08-23  0.436061 -0.298017 -1.461563  0.486023
2019-08-20 -1.197955 -2.391547 -0.289861 -0.957297
2019-08-19  0.290107 -1.003232  2.150938 -0.219107

In [124]:
df2.sort_index(axis=0, ascending=False)

                  f4        f2        f3        f1
2019-08-24  1.698973 -1.928416  0.497166  1.065241
2019-08-23  0.486023 -0.298017 -1.461563  0.436061
2019-08-22  1.947095 -0.426321  1.890617 -0.591570
2019-08-21  0.492458  0.458595  0.405646 -1.591266
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955
2019-08-19 -0.219107 -1.003232  2.150938  0.290107

In [125]:
df2.sort_index(axis=1, ascending=False)

                  f4        f3        f2        f1
2019-08-21  0.492458  0.405646  0.458595 -1.591266
2019-08-22  1.947095  1.890617 -0.426321 -0.591570
2019-08-24  1.698973  0.497166 -1.928416  1.065241
2019-08-23  0.486023 -1.461563 -0.298017  0.436061
2019-08-20 -0.957297 -0.289861 -2.391547 -1.197955
2019-08-19 -0.219107  2.150938 -1.003232  0.290107

In [126]:
df2.sort_values(by='f4')

                  f4        f2        f3        f1
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955
2019-08-19 -0.219107 -1.003232  2.150938  0.290107
2019-08-23  0.486023 -0.298017 -1.461563  0.436061
2019-08-21  0.492458  0.458595  0.405646 -1.591266
2019-08-24  1.698973 -1.928416  0.497166  1.065241
2019-08-22  1.947095 -0.426321  1.890617 -0.591570

In [127]:
df2.sort_values(by='f4', ascending=False)

                  f4        f2        f3        f1
2019-08-22  1.947095 -0.426321  1.890617 -0.591570
2019-08-24  1.698973 -1.928416  0.497166  1.065241
2019-08-21  0.492458  0.458595  0.405646 -1.591266
2019-08-23  0.486023 -0.298017 -1.461563  0.436061
2019-08-19 -0.219107 -1.003232  2.150938  0.290107
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955

In [128]:
df2['f5'] = np.random.randint(0, 6, size=6)
df2['f6'] = ['alpha', 'beta', 'gamma', 'gamma', 'alpha', 'gamma']
df2

                  f4        f2        f3        f1  f5     f6
2019-08-21  0.492458  0.458595  0.405646 -1.591266   5  alpha
2019-08-22  1.947095 -0.426321  1.890617 -0.591570   0   beta
2019-08-24  1.698973 -1.928416  0.497166  1.065241   4  gamma
2019-08-23  0.486023 -0.298017 -1.461563  0.436061   2  gamma
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955   4  alpha
2019-08-19 -0.219107 -1.003232  2.150938  0.290107   3  gamma

In [129]:
df2.sort_values(by=['f5', 'f6'])

                  f4        f2        f3        f1  f5     f6
2019-08-22  1.947095 -0.426321  1.890617 -0.591570   0   beta
2019-08-23  0.486023 -0.298017 -1.461563  0.436061   2  gamma
2019-08-19 -0.219107 -1.003232  2.150938  0.290107   3  gamma
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955   4  alpha
2019-08-24  1.698973 -1.928416  0.497166  1.065241   4  gamma
2019-08-21  0.492458  0.458595  0.405646 -1.591266   5  alpha

In [130]:
# unique()

df2['f6'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [132]:
# value_counts()

df2['f6'].value_counts()

gamma    3
alpha    2
beta     1
Name: f6, dtype: int64

In [133]:
df2['f6'].isin(['alpha', 'gamma'])

2019-08-21     True
2019-08-22    False
2019-08-24     True
2019-08-23     True
2019-08-20     True
2019-08-19     True
Name: f6, dtype: bool

In [135]:
df2.loc[df2['f6'].isin(['alpha','gamma']) == 1, :]

                  f4        f2        f3        f1  f5     f6
2019-08-21  0.492458  0.458595  0.405646 -1.591266   5  alpha
2019-08-24  1.698973 -1.928416  0.497166  1.065241   4  gamma
2019-08-23  0.486023 -0.298017 -1.461563  0.436061   2  gamma
2019-08-20 -0.957297 -2.391547 -0.289861 -1.197955   4  alpha
2019-08-19 -0.219107 -1.003232  2.150938  0.290107   3  gamma

In [136]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=['b', 'd', 'e'],
                   index=['seoul', 'incheon', 'busan', 'daegu'])
df3

                b         d         e
seoul    0.072260 -2.155512  0.562383
incheon  1.185242 -0.939793 -2.102446
busan   -0.895582 -0.872699 -0.788364
daegu    1.165088 -0.415682  1.604928

In [0]:
func = lambda x: x.max()-x.min()

In [139]:
df3.apply(func, axis=0)

b    2.080824
d    1.739831
e    3.707374
dtype: float64

In [140]:
df3.apply(func, axis=1)

seoul      2.717896
incheon    3.287688
busan      0.107218
daegu      2.020610
dtype: float64

In [148]:
df3.apply(func, axis=1).loc['seoul']

2.7178955879583144

In [149]:
df3.apply(func, axis=0)['e']

3.7073737552886037